{
  "ok": true,
  "videoId": "FeN0XfU5P8I",
  "metadata": {
    "videoId": "FeN0XfU5P8I",
    "title": "전용기 빌렸습니다",
    "duration": "7:00",
    "publishDate": "2026-02-11",
    "nativeChapters": []
  },
  "segments": [
    {
      "text": "I rented a private jet.",
      "startSeconds": 0.8,
      "durationSeconds": 1.3
    },
    {
      "text": "It's been a dream of mine since I was little, to fly in a private jet, so,",
      "startSeconds": 4.577,
      "durationSeconds": 4.028
    },
    {
      "text": "ever since I started my channel, I've been going on and on, about travelling on one.",
      "startSeconds": 8.855,
      "durationSeconds": 4.541
    },
    {
      "text": "And I've been talking with a certain company about it, for about two years.",
      "startSeconds": 13.646,
      "durationSeconds": 2.828
    },
    {
      "text": "But the thing is, if I were to rent a jet from Korea to wherever my destination",
      "startSeconds": 16.735,
      "durationSeconds": 4.332
    },
    {
      "text": "would be, it'd cost me at least 80 to 200 million won. So when I was like, \"Is there",
      "startSeconds": 21.317,
      "durationSeconds": 5.137
    },
    {
      "text": "ANY other way we could do this for a little cheaper? \" I was told they had",
      "startSeconds": 26.704,
      "durationSeconds": 3.883
    },
    {
      "text": "last- minute discounds, just like regular airlines. If a client gets off a",
      "startSeconds": 30.837,
      "durationSeconds": 3.159
    },
    {
      "text": "jet at the destination, and the plane were to return without a passenger,",
      "startSeconds": 34.246,
      "durationSeconds": 3.25
    },
    {
      "text": "you could get on that return flight a bit cheaper.",
      "startSeconds": 37.746,
      "durationSeconds": 2.103
    },
    {
      "text": "And of course, it's only relatively cheaper, and I might not be",
      "startSeconds": 40.134,
      "durationSeconds": 3.461
    },
    {
      "text": "able to pick my date, or destination, but since my literal purpose is to fly on",
      "startSeconds": 43.845,
      "durationSeconds": 3.634
    },
    {
      "text": "a private jet, I asked them to let me know if something like that came up. And they",
      "startSeconds": 47.729,
      "durationSeconds": 3.188
    },
    {
      "text": "reached out to me a couple days ago, telling me that there was a flight",
      "startSeconds": 51.167,
      "durationSeconds": 3.088
    },
    {
      "text": "available from Cebu to Singapore for a cheaper price. It IS on a bit of a",
      "startSeconds": 54.505,
      "durationSeconds": 3.458
    },
    {
      "text": "tight schedule. I made zero won this month. Nada. Didn't get any sponsors",
      "startSeconds": 58.213,
      "durationSeconds": 3.114
    },
    {
      "text": "this month, so I made nothing. 't have any So I couldn't let an opportunity like",
      "startSeconds": 61.577,
      "durationSeconds": 3.014
    },
    {
      "text": "this slip away. So I pulled together literally all the money I could to book",
      "startSeconds": 64.841,
      "durationSeconds": 3.219
    },
    {
      "text": "a flight, and so now, I am off to Cebu.",
      "startSeconds": 68.31,
      "durationSeconds": 2.266
    },
    {
      "text": "[It's cold as heck] [Private jet company sent me a cab] [Maybach cab is wild]",
      "startSeconds": 70.826,
      "durationSeconds": 5.351
    },
    {
      "text": "I arrived in Cebu. The time's right around 1a. m. But the thing is, the flight",
      "startSeconds": 84.571,
      "durationSeconds": 5.046
    },
    {
      "text": "to Singapore doesn't depart till 1p. m. today, 12 hours from now, so I booked a",
      "startSeconds": 89.867,
      "durationSeconds": 3.937
    },
    {
      "text": "hotel in the airport. Trying to get some sleep. Gonna get some shut- eye,",
      "startSeconds": 94.054,
      "durationSeconds": 3.268
    },
    {
      "text": "get freshened up, and then get going. Alright, we're finally off to fly on our",
      "startSeconds": 97.572,
      "durationSeconds": 3.851
    },
    {
      "text": "private jet. And apparently, we're not flying out of Cebu Airport like I",
      "startSeconds": 101.673,
      "durationSeconds": 2.947
    },
    {
      "text": "usually would. They have like this private hangar where they fly in and out,",
      "startSeconds": 104.87,
      "durationSeconds": 3.085
    },
    {
      "text": "so yeah, that's where we're headed right now. This private hangar. And we're",
      "startSeconds": 108.205,
      "durationSeconds": 3.365
    },
    {
      "text": "here! Security was pretty tight here. I almost felt like I was in a restricted",
      "startSeconds": 111.82,
      "durationSeconds": 4.028
    },
    {
      "text": "area where I shoudn't be. So yeah. This part was a little bit scary. But once",
      "startSeconds": 116.098,
      "durationSeconds": 3.814
    },
    {
      "text": "I showed them my passport and made a call, the employees there came out to show",
      "startSeconds": 120.162,
      "durationSeconds": 3.501
    },
    {
      "text": "me in. I was curious to see if they checked luggage on private jets,",
      "startSeconds": 123.913,
      "durationSeconds": 3.137
    },
    {
      "text": "which they did! But since I was the only one being checked, it didn't take long",
      "startSeconds": 127.3,
      "durationSeconds": 4.819
    },
    {
      "text": "at all. And now we're off to catch our flight. It's probably been less than",
      "startSeconds": 132.369,
      "durationSeconds": 4.344
    },
    {
      "text": "five minutes since we arrived at the hangar. And this, is the private jet",
      "startSeconds": 136.963,
      "durationSeconds": 3.769
    },
    {
      "text": "I'll be taking today. It's not a big plane. It's quite small. I got too",
      "startSeconds": 140.982,
      "durationSeconds": 4.045
    },
    {
      "text": "excited and arrived early, so I waited for a bit. I didn't have to check in my",
      "startSeconds": 145.277,
      "durationSeconds": 3.509
    },
    {
      "text": "luggage like I would on normal flights. Because there's like this trunk",
      "startSeconds": 149.036,
      "durationSeconds": 2.498
    },
    {
      "text": "compartment right here. So they loaded up my suitcase here. I got to look around the",
      "startSeconds": 151.784,
      "durationSeconds": 3.331
    },
    {
      "text": "runway for a bit. And although this was a private hangar, it is connected to",
      "startSeconds": 155.365,
      "durationSeconds": 3.567
    },
    {
      "text": "the airport. So they actually share the same runway that they use at",
      "startSeconds": 159.182,
      "durationSeconds": 3.281
    },
    {
      "text": "Saybu airport. I got to see some planes taking off from super up- close, which was",
      "startSeconds": 162.713,
      "durationSeconds": 3.58
    },
    {
      "text": "pretty insane on its own. And now, it was finally time to fly on my private jet.",
      "startSeconds": 166.543,
      "durationSeconds": 4.059
    },
    {
      "text": "Once I took a seat, they brought me some snacks, which was nice. On this",
      "startSeconds": 170.852,
      "durationSeconds": 3.734
    },
    {
      "text": "flight were two pilots, two flight attendants, the CEO of the jet company,",
      "startSeconds": 174.836,
      "durationSeconds": 4.163
    },
    {
      "text": "and the Dokgodok crew. By the way, the CEO of the company sponsored a part of the",
      "startSeconds": 179.249,
      "durationSeconds": 4.315
    },
    {
      "text": "charges for this private jet. So a huge shoutout to him. You can rent a private",
      "startSeconds": 183.814,
      "durationSeconds": 4.355
    },
    {
      "text": "jet just like this one on UJT AllRide. If you go to their Instagram, you'll see",
      "startSeconds": 188.419,
      "durationSeconds": 4.602
    },
    {
      "text": "these real- time posts of discounts, So yeah, if you ever need private jets,",
      "startSeconds": 193.271,
      "durationSeconds": 2.941
    },
    {
      "text": "now you know where to look. Back to the video, it's time for takeoff.",
      "startSeconds": 196.462,
      "durationSeconds": 3.527
    },
    {
      "text": "The captain came out himself to give us all the announcements. I can see the",
      "startSeconds": 200.239,
      "durationSeconds": 4.038
    },
    {
      "text": "cockpit from my seat. Isn't that crazy? I wondered if the takeoff would feel any",
      "startSeconds": 204.527,
      "durationSeconds": 3.723
    },
    {
      "text": "different on a small plane, but you know, it felt exactly the same. But if I'm",
      "startSeconds": 208.5,
      "durationSeconds": 4.683
    },
    {
      "text": "being honest, the actual flight lowkey felt crazy. I fly all the time, so I",
      "startSeconds": 213.433,
      "durationSeconds": 3.983
    },
    {
      "text": "didn't expect much from it, but I feel like being on a private jet makes all",
      "startSeconds": 217.666,
      "durationSeconds": 3.76
    },
    {
      "text": "the difference. Even though I have dreamed of flying like this ever since I was a",
      "startSeconds": 221.676,
      "durationSeconds": 3.574
    },
    {
      "text": "little kid, I never thought that I'd actually be able to. But now I'm actually",
      "startSeconds": 225.5,
      "durationSeconds": 3.835
    },
    {
      "text": "doing it! So yeah, that was a bit trippy to think about. I feel like I've really",
      "startSeconds": 229.585,
      "durationSeconds": 3.882
    },
    {
      "text": "made it in life, you know? Weather looked a bit disappointing from the ground,",
      "startSeconds": 233.717,
      "durationSeconds": 3.638
    },
    {
      "text": "but the clouds looked amazing from above. I mean, even more so than they usually do.",
      "startSeconds": 237.605,
      "durationSeconds": 4.652
    },
    {
      "text": "And now, the highlight of any flight: the in- flight meal. I don't speak English",
      "startSeconds": 242.507,
      "durationSeconds": 4.48
    },
    {
      "text": "very well, so the CEO had to be my interpreter. Apparently, the choice was",
      "startSeconds": 247.237,
      "durationSeconds": 4.586
    },
    {
      "text": "between chicken, beef, and fish. And so I went with beef. There's no",
      "startSeconds": 252.073,
      "durationSeconds": 5.049
    },
    {
      "text": "kitchen, obviously, so they pulled these out of a bag and heated them up for us.",
      "startSeconds": 257.372,
      "durationSeconds": 3.389
    },
    {
      "text": "I don't know if it's because we were on a private jet, but personally, I thought it",
      "startSeconds": 261.011,
      "durationSeconds": 3.407
    },
    {
      "text": "was pretty delicious. And after that, dessert was served. A piece of cake that's",
      "startSeconds": 264.668,
      "durationSeconds": 4.205
    },
    {
      "text": "kinda like castella, along with some fruit. I'm not a big coffee or",
      "startSeconds": 269.123,
      "durationSeconds": 3.091
    },
    {
      "text": "tea person, so I skipped tea. And then I noticed this tiny little screen on",
      "startSeconds": 272.464,
      "durationSeconds": 4.17
    },
    {
      "text": "the side, which was showing the flight information and such. There was a phone on",
      "startSeconds": 276.884,
      "durationSeconds": 3.649
    },
    {
      "text": "board as well, which I personally didn't need. And obviously, I HAD to check",
      "startSeconds": 280.783,
      "durationSeconds": 3.561
    },
    {
      "text": "out the restroom. The toilet kinda looks like a chair. And here's the sink.",
      "startSeconds": 284.594,
      "durationSeconds": 4.148
    },
    {
      "text": "Pretty cool. This plane is a 6- seater, so when they get 6 passengers, they don't",
      "startSeconds": 288.992,
      "durationSeconds": 4.269
    },
    {
      "text": "have flight attendants. It's only when they have five passengers or fewer that",
      "startSeconds": 293.511,
      "durationSeconds": 3.464
    },
    {
      "text": "they do. It was about a four- hour flight from Cebu to Singapore, And some time into",
      "startSeconds": 297.225,
      "durationSeconds": 4.777
    },
    {
      "text": "the flight, my excitement started to die out a litle. I started getting a",
      "startSeconds": 302.252,
      "durationSeconds": 3.097
    },
    {
      "text": "little sleepy, so I took a nap. The seats didn't recline all the way back, but they",
      "startSeconds": 305.599,
      "durationSeconds": 3.815
    },
    {
      "text": "were comfortable. I couldn't ask for a better seat for a quick nap. There was",
      "startSeconds": 309.664,
      "durationSeconds": 3.665
    },
    {
      "text": "still some time left after I woke up, so I fiddled with my \"Today\" cards for a",
      "startSeconds": 313.579,
      "durationSeconds": 3.849
    },
    {
      "text": "little bit of practice. Playing with cards on a private flight? What is this?",
      "startSeconds": 317.678,
      "durationSeconds": 3.571
    },
    {
      "text": "\"Now You See Me\"? And then it was time for our last snack before landing. And then",
      "startSeconds": 321.499,
      "durationSeconds": 4.961
    },
    {
      "text": "of course, the landing. Normal flights make you prepare for landing about half an",
      "startSeconds": 326.71,
      "durationSeconds": 4.254
    },
    {
      "text": "hour in advance, but on a private jet, it was like right before the",
      "startSeconds": 331.214,
      "durationSeconds": 3.682
    },
    {
      "text": "actual landing. I was also curious about the landing experience, and yes, it was as",
      "startSeconds": 335.146,
      "durationSeconds": 4.163
    },
    {
      "text": "smooth as I expected. Yes! We're finally in Singapore, baby! The weather makes the",
      "startSeconds": 339.559,
      "durationSeconds": 4.531
    },
    {
      "text": "plane seem even cooler than I remember it to be. As soon as we got off, a bus came",
      "startSeconds": 344.34,
      "durationSeconds": 3.988
    },
    {
      "text": "to pick us up right in front of the plane. We landed at an airport dedicated to",
      "startSeconds": 348.578,
      "durationSeconds": 4.364
    },
    {
      "text": "private jets, not Changi airport. Apparently, they fix the aircrafts here",
      "startSeconds": 353.192,
      "durationSeconds": 3.858
    },
    {
      "text": "as well. And apparently, all of these are private jets. I think this every time I do",
      "startSeconds": 357.3,
      "durationSeconds": 4.335
    },
    {
      "text": "one of these videos, but man, are there a lot of rich people in this world.",
      "startSeconds": 361.885,
      "durationSeconds": 3.015
    },
    {
      "text": "This place has as many planes parked here as my apartment building does cars. We got",
      "startSeconds": 365.15,
      "durationSeconds": 4.459
    },
    {
      "text": "off the car right at the immigration office. Obviously, since no",
      "startSeconds": 369.859,
      "durationSeconds": 2.757
    },
    {
      "text": "one else was going through it, there was not a queue in sight. The immigration",
      "startSeconds": 372.866,
      "durationSeconds": 3.436
    },
    {
      "text": "process only took about a minute as well. This is a dedicated lounge for those",
      "startSeconds": 376.552,
      "durationSeconds": 4.252
    },
    {
      "text": "waiting for their private jets or transfer flights. This place is",
      "startSeconds": 381.054,
      "durationSeconds": 3.569
    },
    {
      "text": "proper boujie. I honestly thought this would turn out to be a 20- minute video",
      "startSeconds": 384.873,
      "durationSeconds": 3.721
    },
    {
      "text": "at least, but it's been a while since I last filmed a full- length video. I didn't",
      "startSeconds": 388.844,
      "durationSeconds": 3.039
    },
    {
      "text": "realize how short it'd be till I started editing. Anyway, they bring the",
      "startSeconds": 392.133,
      "durationSeconds": 2.762
    },
    {
      "text": "luggage out to the entrance once we leave the lobby. See all these expensive cars",
      "startSeconds": 395.145,
      "durationSeconds": 3.685
    },
    {
      "text": "parked out front? Crazy. The private jet company called us a van as well, so the",
      "startSeconds": 399.08,
      "durationSeconds": 4.246
    },
    {
      "text": "ride to the hotel was a breeze. And yeah, that's all for today's video! I've noticed",
      "startSeconds": 403.576,
      "durationSeconds": 4.093
    },
    {
      "text": "that a lot of you have been watching my videos without subscribing. So if you",
      "startSeconds": 407.919,
      "durationSeconds": 3.742
    },
    {
      "text": "haven't done so already, please go ahead and hit that subscribe. And I'll make sure",
      "startSeconds": 411.911,
      "durationSeconds": 3.734
    },
    {
      "text": "to be back with bigger, better, and more entertaining content.",
      "startSeconds": 415.895,
      "durationSeconds": 2.838
    },
    {
      "text": "Thank you for watching!",
      "startSeconds": 418.983,
      "durationSeconds": 1.512
    }
  ]
}